In [5]:
import pandas as pd

# Datos en formato diccionario
datos = {
    "Nombre": ["Lucía", "Carlos", "María", "David", "Ana", "Pepe"],
    "Edad": [28, 35, 22, 41, 30, 18],
    "Sexo": ["F", "M", "F", "M", "F", "M"],
    "Ciudad": ["Madrid", "Barcelona", "Valencia", "Sevilla", "Bilbao", "Badajoz"],
    "Salario": [32000, 45000, 29000, 51000, 38000, 27000]
}

# Crear DataFrame
df = pd.DataFrame(datos)

In [4]:
# Guardar como CSV
df.to_csv("datos.csv", index=False)

In [7]:
df = pd.read_csv("datos.csv")
print(df.tail())

         Nombre  Edad Sexo         Ciudad  Salario
2         María    22    F       Valencia    29000
3         David    41    M        Sevilla    51000
4           Ana    30    F         Bilbao    38000
5          Pepe    18    M        Badajoz    27000
6  Juan Antonio    23    M  Huércal-Overa    34000

In [8]:
print(df)

         Nombre  Edad Sexo         Ciudad  Salario
0         Lucía    28    F         Madrid    32000
1        Carlos    35    M      Barcelona    45000
2         María    22    F       Valencia    29000
3         David    41    M        Sevilla    51000
4           Ana    30    F         Bilbao    38000
5          Pepe    18    M        Badajoz    27000
6  Juan Antonio    23    M  Huércal-Overa    34000

In [10]:
#Numero de filas y columnas
print(df.shape)

#Nombres de las columnas
print(df.columns)

#Tipos de datos y valores nulos
print(df.info())

(7, 5)
Index(['Nombre', 'Edad', 'Sexo', 'Ciudad', 'Salario'], dtype='object')
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Nombre   7 non-null      object
 1   Edad     7 non-null      int64
 2   Sexo     7 non-null      object
 3   Ciudad   7 non-null      object
 4   Salario  7 non-null      int64
dtypes: int64(2), object(3)
memory usage: 412.0+ bytes
None

In [11]:
#Estadísticas numéricas básicas
print(df.describe())

            Edad       Salario
count   7.000000      7.000000
mean   28.142857  36571.428571
std     7.988086   8734.169353
min    18.000000  27000.000000
25%    22.500000  30500.000000
50%    28.000000  34000.000000
75%    32.500000  41500.000000
max    41.000000  51000.000000

In [13]:
#Columna individual
print(df["Edad"])

#Fila por posicion
print(df.iloc[6])

0    28
1    35
2    22
3    41
4    30
5    18
6    23
Name: Edad, dtype: int64
Nombre      Juan Antonio
Edad                  23
Sexo                   M
Ciudad     Huércal-Overa
Salario            34000
Name: 6, dtype: object

In [14]:
import seaborn as sns
import pandas as pd #¿Necesario?

df = sns.load_dataset("titanic")
print(df.head())

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True

In [15]:
from sklearn.datasets import fetch_california_housing

data = fetch_california_housing(as_frame=True) #as_frame=True hace que la función devuelva los datos como un DataFrame de pandas, en lugar de un array de NumPy
df = data.frame    #data.frame contiene un pandas.DataFrame con variables independientes y objetivo
print(df.head())

   MedInc  HouseAge  AveRooms  AveBedrms  Population  AveOccup  Latitude  \
0  8.3252      41.0  6.984127   1.023810       322.0  2.555556     37.88
1  8.3014      21.0  6.238137   0.971880      2401.0  2.109842     37.86
2  7.2574      52.0  8.288136   1.073446       496.0  2.802260     37.85
3  5.6431      52.0  5.817352   1.073059       558.0  2.547945     37.85
4  3.8462      52.0  6.281853   1.081081       565.0  2.181467     37.85

   Longitude  MedHouseVal
0    -122.23        4.526
1    -122.22        3.585
2    -122.24        3.521
3    -122.25        3.413
4    -122.25        3.422